def n1():
    import random

    a = [random.randint(1, 10) for i in range(5)]
    b = int(input('Введите число:'))
    if b in a:
        print("Поздравляю, Вы угадали число!")
    else:
        print("Нет такого числа!")
    print('Были загаданы числа:', a)


def n2():
    my_list = [3, 8, 12, 6, 5, 8, 12]
    num = len(my_list)

    for x in range(0, num + 1):
        for y in range(x + 1, num):
            if my_list[x] == my_list[y]:
                print("В списке есть повторение: ", my_list[x])


def n3():
    a = ('пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс')
    b = int(input('сколько выходных дней на неделе вы хотите?'))
    print('ваши выходные дни: ', a[-b:])
    print('ваши рабочие дни: ', a[:-b])


def n4():
    import random
    s = ["Денисов", "Волков", "Психоделиков", "Лузеров", "Тойотов", "Найнмайсов", "Анжелов", "Каев", "Дестроев"]
    s1 = ["Яриз", "Лохов", "Кунков", "Парадаев", "Пингвинов", "Иванов", "Бесов", "Матюкевич", "Шабаловская",
          "Спамерский"]
    s2 = random.sample(s, 5) + random.sample(s1, 5)
    r = len(s2)
    print("Первая группа", s)
    print("Вторая группа", s1)
    print("Команда", s2)
    print("Кол-во людей в команде", r)
    s2.sort()
    print("Команда по алфавиту", s2)
    if 'Иванов' in s2:
        k = s2.count('Психоделиков')
        print("Да, люди с фамилей Психоделиков  в команде", k)
    else:
        print("Нет, Психоделиков не входит в команду")


n1()
n2()
n3()
n4()